//
//  AddressManager.swift
//  COManager
//
//  Created by sean on 2022/10/27.
//

import Foundation

import CODomain

public final class AddressManager: AddressService {
  
  public static let shared: AddressManager = AddressManager()
  
  public var addressList: [법정주소] {
    return [
      .init(법정동명: "강남구", 법정코드: 1168000000),
      .init(법정동명: "강동구", 법정코드: 1174000000),
      .init(법정동명: "강북구", 법정코드: 1130500000),
      .init(법정동명: "강서구", 법정코드: 1150000000),
      .init(법정동명: "관악구", 법정코드: 1162000000),
      .init(법정동명: "광진구", 법정코드: 1121500000),
      .init(법정동명: "구로구", 법정코드: 1168000000),
      .init(법정동명: "금천구", 법정코드: 1168000000),
      .init(법정동명: "노원구", 법정코드: 1168000000),
      .init(법정동명: "도봉구", 법정코드: 1168000000),
      .init(법정동명: "동대문구", 법정코드: 1168000000),
      .init(법정동명: "동작구", 법정코드: 1168000000),
      .init(법정동명: "마포구", 법정코드: 1168000000),
      .init(법정동명: "서대문구", 법정코드: 1168000000),
      .init(법정동명: "서초구", 법정코드: 1168000000),
      .init(법정동명: "성동구", 법정코드: 1168000000),
      .init(법정동명: "성북구", 법정코드: 1168000000),
      .init(법정동명: "송파구", 법정코드: 1168000000),
      .init(법정동명: "양천구", 법정코드: 1168000000),
      .init(법정동명: "영등포구", 법정코드: 1168000000),
      .init(법정동명: "용산구", 법정코드: 1168000000),
      .init(법정동명: "은평구", 법정코드: 1168000000),
      .init(법정동명: "종로구", 법정코드: 1168000000),
      .init(법정동명: "중구", 법정코드: 1168000000),
      .init(법정동명: "중랑구", 법정코드: 1168000000)
    ]
  }
  
  private init() {}
}
